
rules = ', приветы!\U00002764\nЯ умею играть в конфетки!\U0001F36C\n\nМы будем играть с тобой вдвоем.\U0001F93C\nПредставь, что на столе лежит 100 конфет. ' + \
        'По очереди мы будем брать конфеты и победит тот, кто заберет последние конфетки со стола. За один раз можно взять от 1 до 28 конфет.\n\n' + \
        'Если хочешь поиграть со мной, жмякни на /new_game.'
        
little = ['Ой, а че так мало? Ты на диете?\U0001F966', 'Скромничаешь?\U0001F92A']
many = ['Огогошечки, смотри не потолстей от такого количества!\U0001F383', 'Жадина, зачем тебе столько?\U0001F60B', 'Ничосе сколько! Подарю тебе абонемент в спортзал!\U0001F3CB']
other = ['От одной конфетки ничего не будет. Съем сто.', 'В жизни каждого человека наступает кризис, когда он начинает есть невкусные конфеты со дна вазочки.', 
        'Вот угощайся — бери конфеты, сколько хочешь, хоть две.', 'Дети в России очень смелые… Они едят конфеты БАБАЕВСКОЙ конфетной фабрики.', 'Жизнь, она как конфеты... кому с коньячком, а кому сосательные.']


# from random import choice

# print(choice(many))